import re

def normalize_apostrophes(text):
    return re.sub(r"[‘’ʻʼʽ`ʿ´]", "'", text)

def is_kiril(text):
    return bool(re.search(r'[а-яА-ЯёЁҚҒҲЎқғҳў]', text))

def kiril_to_lotin(text):
    text = normalize_apostrophes(text)
    replacements = [
        ('Щ', 'Shch'), ('Ш', 'Sh'), ('Ч', 'Ch'), ('Ц', 'Ts'),
        ('Ю', 'Yu'), ('Я', 'Ya'), ('Ё', 'Yo'), ('Ж', 'J'),
        ('Ғ', "G‘"), ('Ў', "O‘"), ('Қ', 'Q'), ('Ҳ', 'H'),
        ('щ', 'shch'), ('ш', 'sh'), ('ч', 'ch'), ('ц', 'ts'),
        ('ю', 'yu'), ('я', 'ya'), ('ё', 'yo'), ('ж', 'j'),
        ('ғ', "g‘"), ('ў', "o‘"), ('қ', 'q'), ('ҳ', 'h'),
    ]
    for k, v in replacements:
        text = text.replace(k, v)
    table = str.maketrans({
        'А': 'A', 'Б': 'B', 'В': 'V', 'Г': 'G', 'Д': 'D', 'Е': 'E',
        'З': 'Z', 'И': 'I', 'Й': 'Y', 'К': 'K', 'Л': 'L', 'М': 'M',
        'Н': 'N', 'О': 'O', 'П': 'P', 'Р': 'R', 'С': 'S', 'Т': 'T',
        'У': 'U', 'Ф': 'F', 'Х': 'X', 'Ъ': "'", 'Ы': 'I', 'Ь': '',
        'Э': 'E', 'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd',
        'е': 'e', 'з': 'z', 'и': 'i', 'й': 'y', 'к': 'k', 'л': 'l',
        'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p', 'р': 'r', 'с': 's',
        'т': 't', 'у': 'u', 'ф': 'f', 'х': 'x', 'ъ': "'", 'ы': 'i',
        'ь': '', 'э': 'e'
    })
    return text.translate(table)

def lotin_to_kiril(text):
    text = normalize_apostrophes(text)
    combos = [
        ('Shch', 'Щ'), ('shch', 'щ'),
        ('Sh', 'Ш'), ('sh', 'ш'),
        ('Ch', 'Ч'), ('ch', 'ч'),
        ('Yo', 'Ё'), ('yo', 'ё'),
        ('Yu', 'Ю'), ('yu', 'ю'),
        ('Ya', 'Я'), ('ya', 'я'),
        ('Ts', 'Ц'), ('ts', 'ц'),
        ("G‘", 'Ғ'), ("g‘", 'ғ'), ("G'", 'Ғ'), ("g'", 'ғ'),
        ("O‘", 'Ў'), ("o‘", 'ў'), ("O'", 'Ў'), ("o'", 'ў'),
        ("Q", 'Қ'), ("q", 'қ'), ("H", 'Ҳ'), ("h", 'ҳ'),
    ]
    for l, k in combos:
        text = re.sub(re.escape(l), k, text)
    table = str.maketrans({
        'A': 'А', 'B': 'Б', 'D': 'Д', 'E': 'Е', 'F': 'Ф',
        'G': 'Г', 'I': 'И', 'J': 'Ж', 'K': 'К', 'L': 'Л',
        'M': 'М', 'N': 'Н', 'O': 'О', 'P': 'П', 'R': 'Р',
        'S': 'С', 'T': 'Т', 'U': 'У', 'V': 'В', 'X': 'Х',
        'Y': 'Й', 'Z': 'З',
        'a': 'а', 'b': 'б', 'd': 'д', 'e': 'е', 'f': 'ф',
        'g': 'г', 'i': 'и', 'j': 'ж', 'k': 'к', 'l': 'л',
        'm': 'м', 'n': 'н', 'o': 'о', 'p': 'п', 'r': 'р',
        's': 'с', 't': 'т', 'u': 'у', 'v': 'в', 'x': 'х',
        'y': 'й', 'z': 'з', "'": 'ъ'
    })
    return text.translate(table)
